package itmoLessons.lesson5StringBuilder;

import java.util.Arrays;

public class StringLesson5 {
    public static void main(String[] args) {
        //char (примитивнный тип данных) 16 битный символ Unicode
        //от 0 до 65536 / '\u0000' до '\uffff'

        //тип данных char
        char char1 = 'J'; //сам символ
        char char2 = 74; //номер символа
        char char3 = '\u0044'; //0044 - 16тиричное представление в escape последовательности
        System.out.print(char1); //J
        System.out.print(char2); //J
        System.out.print(char3); //D
        //в команде System.out.print() не используется \n а вот в System.out.println() он есть
        System.out.println("\nСтроки");

        //Строка - упорядоченная последовательность символов
        //Строка - ссылочный тип, экземляр класса String
        //Строки задаются в двойных кавычках
        //Строки задаются:
        //1. в двойных кавычках
        //2. new String() - используем если только двойные кавычки использовать не получается, напримевр пришли байты
        //Строки неизменны, можно лищь создать новую строку на основе существующей
        System.out.println("Строковой литерал - это просто строка");

        //new String() поможет создать строку из массива с чарами
        char[] chars = {'\u004A', '\u004A', '\u004A'};
        String jjdString = new String(chars);
        System.out.println(jjdString); // JJJ
        System.out.println(jjdString.length()); // 3

        //если один символ предствлен двумя символами unicode то это суррогатная пара
        char[] chars1 = {'\uD83D', '\uDC38'};
        String frogString = new String(chars1);
        System.out.println(frogString); //эмодзи 🐸
        System.out.println(frogString.length()); //2
        //действительное количество символов
        System.out.println(frogString.codePoints().count()); //1


        //Хранение строк до java 9: массив char[] в кодировке UTF-16
        //Каждый чар был предствлен двумя байтами

        //начиная с 9ой версии строки (компактные строки)
        // хранятся как массив byte[] + кодировка LATIN1 или UTF-16

        //пул строк хранит одну копию строкового литерала
        //пул строк это набор уникальных строк

        //в пул строк добавилась строка и переменная string1 ссылается на на строку из пула

        //пул строк: "Строка"-на эту строку ссылается и string1 и string2
        String string1 = "Строка";
        //в пуле строк уже есть такая страка и переменная string2 ссылается на строчку
        // в пуле строк на ту же что и string1 (две ссылки на один участок памяти)
        String string2 = "Строка";

        //пул строк: "Строка" - куча heap память
        //создали строку в пул строк

        String string3 = new String("Строка");
        //string3 ссылается на стро "Строка" вне пула

        System.out.println(string1 == string2); //true потому что string1 и string2 ведут к одной области памяти в пуле строк
        System.out.println(string1 == string3); //false string1 ведет к однму объекту в памяти а string3 к другому объекту в памяти

        //образаемся к строке не из пула
        //интернирование метод смотрит в пул строк, если есть в пуле строк такая строка, он вернет ссылку на строку из пула
        //string3 это строка в не пула
        String internString = string3.intern();
        //internString ссылается на "Строка" из пула


        //Сравнение строк
        //для сравнения не используем ==, ТК == сравнивает ссылки
        System.out.println(string1.equals(string2)); //true
        System.out.println("строка".equals(string2)); //false equals регистро зависемый оператор
        System.out.println("строка".equalsIgnoreCase(string2)); //true

        //string2 = null;
        System.out.println("строка".equals(string2)); //этот вариант лучше и безопаснее
        // NullPointerException из-за переопределения string2,у null нет метода equals() ошибка времени выполнения
        //System.out.println(string2.equals("строка")); //NullPointerException

        //если нужно проверить на null можно использовать простое сравнение
        System.out.println(string2 == null); //true
        System.out.println(string2 != null); //false

        string1 = "Java";
        string2 = "Python";

        //конкатенация строк
        String contactString = string1 + "::" + string2;
        System.out.println(contactString);
        //.concat возвращает результат объеденения
        contactString = string1.concat(" :: ").concat(string2);
        System.out.println(contactString);

        //.join -объеденение строк по разделителю
        contactString = String.join("::", string1, string2, string3);
        System.out.println(".join" + contactString);

        //так делать нельзя (на каждой этерации цикла создается новая строка) объект строки
        contactString = "";
        for (int i = 0; i < 10; i += 1) {
            contactString += i + " ";
        }
        System.out.println(contactString);

        //StringBuilder - работает быстрее
        //StringBuffer - потокобезопасный
        contactString = "Начало строки ";
        StringBuilder sb = new StringBuilder(contactString);
        //возврщает ссылку на StringBuilder
        //буфер накапливает значение строк
        sb.append(string1).append(" :: ").append(string2);

        //здесь правильно так как билдер будет накапливать строки
        StringBuilder sb2 = new StringBuilder();
        for (int i = 0; i < 10; i += 1) {
            sb2.append(i).append(" ");
        }
        //в println уже реализован метод toString поэтому он возвращает все из StringBuilder
        System.out.println(sb2);

        //toString возвращает строчку которую накопил StringBuilder
        String sbString = sb2.toString();
        System.out.println(sbString);

        //метод split() принимает регулярки
        //мы передали ", " и он пойдет по строчке и будет искать последовательность
        //разбивает строку по разделителю, в массив добавит все что между разделителями
        String langs = "Java, Python, JavaScript";
        String[] langArr = langs.split(", ");
        System.out.println(Arrays.toString(langArr));

        //методы замены
        //.replaceAll() поддерживает регулярки
        // что хотим заменить на что хотим заменять
        System.out.println("было: " + langs);
        String newString = langs.replaceAll(", ", " - ");
        System.out.println("стало: " + newString); //Java - Python - JavaScript

        //заменяет первую последовательность
        newString = langs.replaceFirst(", ", " - ");
        System.out.println(newString); //Java - Python, JavaScript

        //не поддерживает регулярки, только последовательность символов
        newString = langs.replace(", ", " - ");
        System.out.println(newString); //Java - Python, JavaScript

        //проверяет содержит ли последовательность символов
        System.out.println(langs.contains("th"));
        System.out.println(langs.startsWith("j"));
        System.out.println(langs.endsWith("Script"));
        //можно задать с какого индекса начать проверку (с перового)
        System.out.println(langs.startsWith("a", 1));
    }

}
